[["به بویِ نافه‌ای کآخر صبا زان طُرّه بگشاید","ز تابِ جَعدِ مشکینش چه خون افتاد در دل‌ها"],["مرا در منزلِ جانان چه امنِ عیش چون هر دَم","جَرَس فریاد می‌دارد که بَربندید مَحمِل‌ها"],["دلم ز صومعه بگرفت و خِرقِهٔ سالوس","کجاست دیرِ مُغان و شرابِ ناب کجا"],["قرار و خواب ز حافظ طمع مدار ای دوست","قرار چیست صبوری کدام و خواب کجا"],["من از آن حُسن روزافزون که یوسف داشت دانستم","که عشق از پردهٔ عصمت برون آرد زلیخا را"],["نصیحت گوش کن جانا، که از جان دوست‌تر دارند","جوانان سعادتمند پند پیر دانا را"],["دل می‌رود ز دستم صاحب‌دلان خدا را","دردا که راز پنهان خواهد شد آشکارا"],["کشتی‌شکستگانیم ای باد شُرطِه برخیز","باشد که باز بینم دیدار آشنا را"],["ده‌روزه مِهر گردون، افسانه است و افسون","نیکی به جای یاران فرصت شمار یارا"],["ای صاحب کرامت شکرانهٔ سلامت","روزی تَفَقُّدی کن درویش بی‌نوا را"],["آسایش دو گیتی تفسیر این دو حرف است","با دوستان مروت با دشمنان مدارا"],["در کوی نیک‌نامی ما را گذر ندادند","گر تو نمی‌پسندی تغییر کن قضا را"],["حافظ به خود نپوشید این خرقهٔ مِی‌ْآلود","ای شیخ پاک‌دامن معذور دار ما را"],["همه شب در این امیدم که نسیم صبحگاهی","به پیام آشنایان بنوازد آشنا را"],["محرم راز دل شیدای خود","کس نمی‌بینم ز خاص و عام را"],["با دلارامی مرا خاطر خوش است","کز دلم یک باره بُرد آرام را"],["صبر کن حافظ به سختی روز و شب","عاقبت روزی بیابی کام را"],["رونق عهد شباب است دگر بُستان را","می‌رسد مژدهٔ گل بلبل خوش الحان را"],["ترسم این قوم که بر دُردکشان می‌خندند","در سر کار خرابات کنند ایمان را"],["هر که را خوابگه آخر مشتی خاک است","گو چه حاجت که به افلاک کشی ایوان را"],["ماه کنعانی من! مسند مصر آنِ تو شد","وقت آن است که بدرود کنی زندان را"],["حافظا می خور و رندی کن و خوش باش ولی","دام تزویر مکن چون دگران قرآن را"],["در خرابات طریقت ما به هم منزل شویم","کاین چنین رفته‌ست در عهد ازل تقدیر ما"],["عقل اگر داند که دل در بند زلفش چون خوش است","عاقلان دیوانه گردند از پی زنجیر ما"],["ما در پیاله عکس رخ یار دیده‌ایم","ای بی‌خبر ز لذتِ شربِ مدامِ ما"],["هرگز نمیرد آن که دلش زنده شد به عشق","ثبت است بر جریدهٔ عالم دوام ما"],["عزم دیدار تو دارد جانِ بر لب آمده","باز گردد یا برآید؟ چیست فرمان شما؟"],["دل خرابی می‌کند، دلدار را آگه کنید","زینهار ای دوستان جان من و جان شما"],["کی دهد دست این غرض یا رب که همدستان شوند","خاطر مجموع ما، زلف پریشان شما"],["خوابم بشد از دیده در این فکر جگرسوز","کآغوش که شد، منزل آسایش و خوابت؟"],["سینه از آتش دل، در غم جانانه بسوخت","آتشی بود در این خانه، که کاشانه بسوخت"],["سینه از آتش دل، در غم جانانه بسوخت","آتشی بود در این خانه، که کاشانه بسوخت"],["خرقهٔ زهدِ مرا، آب خرابات ببرد","خانهٔ عقلِ مرا، آتش میخانه بسوخت"],["ترک افسانه بگو حافظ و می نوش دمی","که نَخُفتیم شب و شمع به افسانه بسوخت"],["ساقیا آمدنِ عید، مبارک بادت","وان مَواعید که کردی، مَرَواد از یادت"],["شادی مجلسیان در قدم و مقدم توست","جای غم باد، مَر آن دل، که نخواهد شادت"],["شکر ایزد که ز تاراجِ خزان رخنه نیافت","بوستان سمن و سرو و گل و شمشادت"],["حافظ از دست مده دولت این کشتی نوح","ور نه طوفانِ حوادث بِبَرَد بُنیادت"],["ای نسیم سحر آرامگَهِ یار کجاست؟","منزلِ آن مَهِ عاشق‌کُشِ عیّار کجاست؟"],["ای نسیم سحر آرامگَهِ یار کجاست؟","منزلِ آن مَهِ عاشق‌کُشِ عیّار کجاست؟"],["شبِ تار است و رَه وادیِ اَیمَن در پیش","آتش طور کجا؟ موعد دیدار کجاست؟"],["ساقی و مطرب و می جمله مهیاست ولی","عیش، بی‌یار مهیّا نشود، یار کجاست؟"],["حافظ از بادِ خزان، در چمنِ دهر مَرَنج","فکرِ معقول بفرما، گلِ بی‌خار کجاست؟"],["روزه یک سو شد و عید آمد و دل‌ها برخاست","می ز خُمخانه به جوش آمد و می‌باید خواست"],["نوبهٔ زهدفروشانِ گران جان بگذشت","وقتِ رندی و طرب کردن رندان پیداست"],["باده نوشی که در او روی و ریایی نَبُوَد","بهتر از زهدفروشی، که در او روی و ریاست"],["دل و دینم شد و دلبر به ملامت برخاست","گفت با ما منشین کز تو سلامت برخاست"],["سرم به دنیی و عقبی فرو نمی‌آید","تبارک الله از این فتنه‌ها که در سر ماست"],["در اندرون من خسته دل ندانم کیست","که من خموشم و او در فغان و در غوغاست"],["به رغم مدعیانی که منع عشق کنند","جمالِ چهرهٔ تو حجت موجه ماست"],["اگر به زلف دراز تو دست ما نرسد","گناه بخت پریشان و دست کوته ماست"],["من همان دم که وضو ساختم از چشمه عشق","چارتکبیر زدم یکسره بر هر چه که هست"],["می بده تا دهمت آگهی از سِرِّ قضا","که به رویِ که شدم عاشق و از بوی که مست"],["مقام عیش میسر نمی‌شود بی‌رنج","بلی به حکم بلا بسته‌اند عهد الست"],["زلف‌آشفته و خِوی‌کرده و خندان‌لب و مست","پیرهن‌چاک و غزل‌خوان و صُراحی در دست"],["زلف‌آشفته و خِوی‌کرده و خندان‌لب و مست","پیرهن‌چاک و غزل‌خوان و صُراحی در دست"],["نرگسش عربده‌جوی و لبش افسوس‌کنان","نیم شب دوش به بالین من آمد بنشست"],["سر فرا گوش من آورد به آواز حزین","گفت ای عاشق دیرینهٔ من خوابت هست؟"],["برو ای زاهد و بر دُردکشان خرده مگیر","که ندادند جز این تحفه به ما روز الست"],["ما را ز خیال تو چه پروای شراب است؟","خُم گو سر خود گیر، که خُمخانه خراب است"],["ما را ز خیال تو چه پروای شراب است؟","خُم گو سر خود گیر، که خُمخانه خراب است"],["سبز است در و دشت بیا تا نگذاریم","دست از سر آبی که جهان جمله سراب است"],["شیدا از آن شدم که نگارم چو ماه نو","ابرو نمود و جلوه‌گری کرد و رو ببست"],["آن شبِ قدری که گویند اهل خلوت امشب است","یا رب این تأثیرِ دولت در کدامین کوکب است؟"],["شهسوار من که مه آیینه دار روی اوست","تاجِ خورشیدِ بلندش خاکِ نعلِ مرکب است"],["من نخواهم کرد ترک لعل یار و جام می","زاهدان معذور داریدم که اینم مذهب است"],["اندر آن ساعت که بر پشت صبا بندند زین","با سلیمان چون برانم من که مورم مرکب است"],["ز دستِ جورِ تو گفتم ز شهر خواهم رفت","به خنده گفت: که حافظ برو، که پای تو بست؟"],["خلوت گُزیده را به تماشا چه حاجت است","چون کوی دوست هست به صحرا چه حاجت است"],["حافظ! تو ختم کن که هنر خود عیان شود","با مدعی نزاع و مُحاکا چه حاجت است"],["رَواقِ منظرِ چشمِ من آشیانهٔ توست","کَرَم نما و فرود آ که خانه خانهٔ توست"],["سرودِ مجلست اکنون فلک به رقص آرد","که شعرِ حافظِ شیرین سخن ترانهٔ توست"],["دلا منال ز بیداد و جور یار که یار","تو را نصیب همین کرد و این از آن دادست"],["دلِ من در هوسِ رویِ تو ای مونس جان","خاکِ راهیست که در دستِ نسیم افتادست"],["غلامِ همتِ آنم که زیرِ چرخِ کبود","ز هر چه رنگِ تعلق پذیرد آزادست"],["چه گویمت که به میخانه دوش مست و خراب","سروشِ عالَمِ غیبم چه مژده‌ها دادست"],["که ای بلندنظر شاهبازِ سِدره نشین","نشیمن تو نه این کُنجِ محنت آبادست"],["نصیحتی کنمت یاد گیر و در عمل آر","که این حدیث، ز پیرِ طریقتم یادست"],["مجو درستیِ عهد از جهانِ سست نهاد","که این عجوز، عروس هزاردامادست"],["هنگامِ وداعِ تو ز بس گریه که کردم","دور از رخِ تو چشمِ مرا نور نماندست"],["صبر است مرا چارهٔ هجرانِ تو لیکن","چون صبر توان کرد؟ که مقدور نماندست"],["رازی که بَرِ غیر نگفتیم و نگوییم","با دوست بگوییم که او محرم راز است"],["شرحِ شِکَنِ زلفِ خَم اندر خَم جانان","کوته نتوان کرد که این قصه دراز است"],["ای مجلسیان، سوزِ دلِ حافظِ مسکین","از شمع بپرسید که در سوز و گداز است"],["عراق و فارس گرفتی به شعر خوش حافظ","بیا که نوبت بغداد و وقت تبریز است"],["مرغِ خوشخوان را بشارت باد کاندر راهِ عشق","دوست را با نالهٔ شب‌های بیداران خوش است"],["فقیه مدرسه دی مست بود و فتوی داد","که می حرام، ولی بِه ز مالِ اوقاف است"],["نه من ز بی‌عملی در جهان ملولم و بس","ملالتِ عُلما هم ز علمِ بی‌عمل است"],["گل در بر و می در کف و معشوق به کام است","سلطانِ جهانم به چنین روز غلام است"],["گو شمع میارید در این جمع که امشب","در مجلس ما ماهِ رخِ دوست تمام است"],["مِی‌خواره و سرگشته و رندیم و نظرباز","وان کس که چو ما نیست در این شهر کدام است؟"],["قدر مجموعهٔ گل مرغِ سحر داند و بس","که نه هر کو ورقی خواند، معانی دانست"],["شرم از آن چشمِ سیه بادش و مژگان دراز","هر که دل بردنِ او دید و در انکارِ من است"],["گرچه شیرین‌ دهنان پادشهانند ولی","او سلیمانِ زمان است که خاتم با اوست"],["سرِ ارادتِ ما و آستانِ حضرت دوست","که هر چه بر سرِ ما می‌رود ارادتِ اوست"],["بلبلی برگِ گُلی خوش رنگ در منقار داشت","و اندر آن برگ و نوا خوش ناله‌هایِ زار داشت"],["یار اگر ننشست با ما نیست جای اعتراض","پادشاهی کامران بود، از گدایی عار داشت"],["گر مریدِ راهِ عشقی فکرِ بدنامی مکن","شیخِ صنعان خرقه رهنِ خانهٔ خَمّار داشت"],["عیبِ رندان مَکُن ای زاهدِ پاکیزه‌سرشت","که گناهِ دگران بر تو نخواهند نوشت"],["من اگر نیکم و گر بد تو برو خود را باش","هر کسی آن دِرَوَد عاقبتِ کار، که کِشت"],["ناامیدم مکن از سابقهٔ لطفِ ازل","تو پسِ پرده چه دانی که که خوب است و که زشت"],["گل بخندید که از راست نرنجیم ولی","هیچ عاشق سخنِ سخت به معشوق نگفت"],["دل گفت وصالش به دعا باز توان یافت","عمریست که عمرم همه در کارِ دعا رفت"],["احرام چه بندیم؟ چو آن قبله نه این جاست","در سعی چه کوشیم؟ چو از مروه صفا رفت"],["دی گفت طبیب از سرِ حسرت چو مرا دید","هیهات که رنجِ تو ز قانونِ شفا رفت"],["ای دوست به پرسیدنِ حافظ قدمی نه","زان پیش که گویند که از دارِ فنا رفت"],["شنیده‌ام سخنی خوش که پیرِ کنعان گفت","فِراق یار نه آن می‌کند که بتوان گفت"],["فغان که آن مهِ نامهربانِ مِهرگُسِل","به تَرکِ صحبت یاران خود چه آسان گفت"],["ساقی بیا که هاتفِ غیبم به مژده گفت","با درد صبر کن که دوا می‌فرستمت"],["حافظ سرودِ مجلس ما ذکرِ خیرِ توست","بشتاب هان که اسب و قبا می‌فرستمت"],["زان یارِ دلنوازم شُکریست با شکایت","گر نکته دانِ عشقی بشنو تو این حکایت"],["بی مزد بود و مِنَّت هر خدمتی که کردم","یا رب مباد کس را مخدومِ بی عنایت"],["در زلفِ چون کمندش ای دل مپیچ کانجا","سرها بریده بینی بی جرم و بی جنایت"],["در این شبِ سیاهم گم گشت راهِ مقصود","از گوشه‌ای برون آی ای کوکبِ هدایت"],["از هر طرف که رفتم جز وحشتم نَیَفزود","زِنهار از این بیابان وین راهِ بی‌نهایت"],["پس از چندین شکیبایی شبی یا رب توان دیدن","که شمعِ دیده افروزیم در محرابِ ابرویت"],["تو گر خواهی که جاویدان جهان یکسر بیارایی","صبا را گو که بردارد زمانی بُرقِع از رویت"],["من و بادِ صبا مِسکین دو سرگردانِ بی‌حاصل","من از افسونِ چشمت مست و او از بویِ گیسویت"],["دین و دل بردند و قصدِ جان کنند","الغیاث از جورِ خوبان، الغیاث"],["تویی که بر سرِ خوبانِ کشوری چون تاج","سِزَد اگر همهٔ دلبران دَهَندَت باج"],["ز انقلابِ زمانه عجب مدار که چرخ","از این فسانه هزاران هزار دارد یاد"],["ز حسرتِ لبِ شیرین هنوز می‌بینم","که لاله می‌دمد از خونِ دیدهٔ فرهاد"],["بیا بیا که زمانی ز می خراب شویم","مگر رسیم به گنجی در این خراب آباد"],["نمی‌دهند اجازت مرا به سِیرِ سفر","نسیمِ بادِ مُصَلّا و آبِ رُکن آباد"],["گر چه یاران فارِغَند از یادِ من","از من ایشان را هزاران یاد باد"],["جمالت آفتابِ هر نظر باد","ز خوبی رویِ خوبت خوبتر باد"],["تَنَت به نازِ طبیبان نیازمند مباد","وجود نازکت آزردهٔ گزند مباد"],["تَنَت به نازِ طبیبان نیازمند مباد","وجود نازکت آزردهٔ گزند مباد"],["سلامتِ همه آفاق در سلامتِ توست","به هیچ عارضه شخصِ تو دردمند مباد"],["در این چمن چو درآید خزان به یغمایی","رهش به سروِ سهی قامتِ بلند مباد"],["هر آن که رویِ چو ماهت به چشمِ بد بیند","بر آتشِ تو به جز جانِ او سپند مباد"],["حُسن تو همیشه در فزون باد","رویت همه ساله لاله گون باد"],["خسروا گویِ فلک در خَمِ چوگان تو باد","ساحتِ کون و مکان عرصهٔ میدانِ تو باد"],["خسروا گویِ فلک در خَمِ چوگان تو باد","ساحتِ کون و مکان عرصهٔ میدانِ تو باد"],["دیر است که دلدار پیامی نفرستاد","ننوشت سلامی و کلامی نفرستاد"],["دیر است که دلدار پیامی نفرستاد","ننوشت سلامی و کلامی نفرستاد"],["صد نامه فرستادم و آن شاهِ سواران","پیکی نَدوانید و سلامی نفرستاد"],["چندان که زدم لافِ کرامات و مقامات","هیچم خبر از هیچ مقامی نفرستاد"],["من ز مسجد به خرابات نه خود افتادم","اینم از عهدِ ازل حاصلِ فرجام افتاد"],["چه کند کز پی دوران نرود چون پرگار؟","هر که در دایرهٔ گردشِ ایام افتاد"],["زیرِ شمشیرِ غمش رقص‌کُنان باید رفت","کان که شد کشتهٔ او نیک سرانجام افتاد"],["من همان روز ز فرهاد طمع بُبریدم","که عنانِ دلِ شیدا به لبِ شیرین داد"],["درختِ دوستی بنشان که کامِ دل به بار آرد","نهالِ دشمنی بَرکَن که رنج بی‌شمار آرد"],["شبِ صحبت غنیمت دان که بعد از روزگارِ ما","بسی گردش کُنَد گردون، بسی لیل و نهار آرد"],["کسی که از رهِ تقوا قدم برون ننهاد","به عزمِ میکده اکنون رهِ سفر دارد"],["دلی که غیب نمای است و جامِ جم دارد","ز خاتمی که دمی گم شود، چه غم دارد"],["به خَطُّ و خالِ گدایان مده خزینهٔ دل","به دستِ شاهوَشی دِه که محترم دارد"],["نه هر درخت تحمل کند جفایِ خزان","غلامِ همتِ سروم که این قدم دارد"],["چو عاشق می‌شدم گفتم که بُردم گوهرِ مقصود","ندانستم که این دریا چه موجِ خون‌فشان دارد"],["چو در رویت بخندد گُل، مشو در دامَش ای بلبل","که بر گُل اعتمادی نیست، گر حُسنِ جهان دارد"],["خدا را، دادِ من بِسْتان از او ای شَحنهٔ مجلس","که می با دیگری خورده‌ست و با من سر گِران دارد"],["ز سروِ قَدِّ دلجویت مکن محروم چشمم را","بدین سرچشمه‌اش بِنْشان که خوش آبی روان دارد"],["ز خوفِ هجرم ایمن کن اگر امّیدِ آن داری","که از چشمِ بداندیشان خدایت در امان دارد"],["هر آن کو خاطرِ مجموع و یارِ نازنین دارد","سعادت همدم او گشت و دولتْ همنشین دارد"],["پیر دُردی‌کَش ما گر چه ندارد زر و زور","خوش عطابخش و خطاپوش خدایی دارد"],["از سَرِ کُشتهٔ خود می‌گذری همچون باد","چه توان کرد؟ که عمر است و شتابی دارد"],["شاهد آن نیست که موییّ و میانی دارد","بندهٔ طلعتِ آن باش که آنی دارد"],["شاهد آن نیست که موییّ و میانی دارد","بندهٔ طلعتِ آن باش که آنی دارد"],["خَمِ ابرویِ تو در صنعتِ تیراندازی","بُرده از دستِ هر آن کس که کمانی دارد"],["با خرابات نشینان ز کَرامات مَلاف","هر سخن وقتی و هر نکته مکانی دارد"],["جانْ بی جمالِ جانان میلِ جهان ندارد","هر کس که این ندارد حقّا که آن ندارد"],["جانْ بی جمالِ جانان میلِ جهان ندارد","هر کس که این ندارد حقّا که آن ندارد"],["هر شبنمی در این ره صد بحرِ آتشین است","دردا که این معما شرح و بیان ندارد"],["نیست در شهر نگاری که دلِ ما بِبَرَد","بختم ار یار شود رختم از این جا ببرد"],["نیست در شهر نگاری که دلِ ما بِبَرَد","بختم ار یار شود رختم از این جا ببرد"],["باغبانا ز خزان بی‌خبرت می‌بینم","آه از آن روز که بادَت گلِ رعنا ببرد"],["رهزنِ دهر نخفته‌ست مشو ایمن از او","اگر امروز نبرده‌ست که فردا ببرد"],["علم و فضلی که به چل سال دلم جمع آورد","ترسم آن نرگسِ مستانه به یَغما ببرد"],["سحر بلبل حکایت با صبا کرد","که عشقِ رویِ گل با ما چه‌ها کرد"],["غلامِ همتِ آن نازنینم","که کار خیر بی روی و ریا کرد"],["من از بیگانگان دیگر ننالم","که با من هر چه کرد آن آشنا کرد"],["ثوابِ روزه و حجِ قبول آن کس بُرد","که خاکِ میکدهٔ عشق را زیارت کرد"],["حدیثِ عشق ز حافظ شنو نه از واعظ","اگر چه صنعتِ بسیار در عبارت کرد"],["ای کبک خوش خُرام کجا می‌روی؟ بایست","غَرِّه مشو که گربهٔ زاهد نماز کرد"],["حافظ مکن ملامتِ رندان که در ازل","ما را خدا ز زهدِ ریا بی‌نیاز کرد"],["بلبلی خونِ دلی خورد و گلی حاصل کرد","بادِ غیرت به صدش خار پریشان دل کرد"],["طوطیی را به خیالِ شکری دل خوش بود","ناگَهَش سیلِ فنا نقشِ اَمَل، باطل کرد"],["آه و فریاد که از چشمِ حسودِ مهِ چرخ","در لحد، ماهِ کمان ابرویِ من منزل کرد"],["چو باد، عزمِ سرِ کویِ یار خواهم کرد","نفس به بویِ خوشش مُشکبار خواهم کرد"],["به هرزه بی می و معشوق عمر می‌گذرد","بِطالتم بس از امروز کار خواهم کرد"],["هر آبروی که اندوختم ز دانش و دین","نثارِ خاکِ رهِ آن نگار خواهم کرد"],["دست در حلقهٔ آن زلفِ دوتا نتوان کرد","تکیه بر عهدِ تو و بادِ صبا نتوان کرد"],["دست در حلقهٔ آن زلفِ دوتا نتوان کرد","تکیه بر عهدِ تو و بادِ صبا نتوان کرد"],["دامنِ دوست به صد خونِ دل افتاد به دست","به فُسوسی که کُنَد خصم، رها نتوان کرد"],["عارضش را به مَثَل ماهِ فلک نتوان گفت","نسبتِ دوست به هر بی سر و پا نتوان کرد"],["من چه گویم؟ که تو را نازکیِ طبعِ لطیف","تا به حَدّیست که آهسته دعا نتوان کرد"],["میان مهربانان کی توان گفت؟","که یارِ ما چُنین گفت و چُنان کرد"],["عدو با جانِ حافظ آن نکردی","که تیرِ چشمِ آن ابروکمان کرد"],["یاد باد آن که ز ما وقتِ سفر یاد نکرد","به وداعی دلِ غمدیدهٔ ما شاد نکرد"],["یاد باد آن که ز ما وقتِ سفر یاد نکرد","به وداعی دلِ غمدیدهٔ ما شاد نکرد"],["دل به امّیدِ صدایی که مگر در تو رسد","ناله‌ها کرد در این کوه که فرهاد نکرد"],["مطربا پرده بگردان و بزن راهِ عراق","که بدین راه بشد یار و ز ما یاد نکرد"],["دلبر بِرَفت و دلشدگان را خبر نکرد","یادِ حریفِ شهر و رفیقِ سفر نکرد"],["دیدی ای دل که غمِ عشق دگربار چه کرد","چون بشد دلبر و با یارِ وفادار چه کرد"],["دیدی ای دل که غمِ عشق دگربار چه کرد","چون بشد دلبر و با یارِ وفادار چه کرد"],["آه از آن نرگسِ جادو که چه بازی انگیخت","آه از آن مست که با مردمِ هشیار چه کرد"],["اشکِ من رنگِ شفق یافت ز بی‌مِهری یار","طالعِ بی‌شفقت بین که در این کار چه کرد"],["برقی از منزلِ لیلی بدرخشید سحر","وَه که با خرمنِ مجنونِ دل افگار چه کرد"],["ساقیا جامِ مِی‌ام دِه که نگارندهٔ غیب","نیست معلوم که در پردهٔ اسرار چه کرد"],["آن که پُرنقش زد این دایرهٔ مینایی","کس ندانست که در گردشِ پرگار چه کرد"],["فکرِ عشق آتشِ غم در دلِ حافظ زد و سوخت","یارِ دیرینه ببینید که با یار چه کرد"],["نه به هفت آب، که رنگش به صد آتش نرود","آن چه با خرقهٔ زاهد، مِی انگوری کرد"],["سال‌ها دل طلبِ جامِ جم از ما می‌کرد","وآنچه خود داشت ز بیگانه تمنّا می‌کرد"],["سال‌ها دل طلبِ جامِ جم از ما می‌کرد","وآنچه خود داشت ز بیگانه تمنّا می‌کرد"],["گفت آن یار کز او گشت سرِ دار بلند","جُرمش این بود که اسرار هویدا می‌کرد"],["فیضِ روحُ القُدُس ار باز مدد فرماید","دیگران هم بکنند آنچه مسیحا می‌کرد"],["علاج ضعف دل ما کرشمهٔ ساقیست","برآر سر که طبیب آمد و دوا آورد"],["مریدِ پیرِ مُغانم ز من مرنج ای شیخ","چرا که وعده تو کردیّ و او به جا آورد"],["نسیمِ بادِ صبا دوشم آگهی آورد","که روزِ محنت و غم رو به کوتهی آورد"],["زاهدِ خام که انکارِ مِی و جام کند","پخته گردد چو نظر بر میِ خام اندازد"],["دَمی با غم به سر بردن جهان یک سر نمی‌ارزد","به می بفروش دلقِ ما کز این بهتر نمی‌ارزد"],["دَمی با غم به سر بردن جهان یک سر نمی‌ارزد","به می بفروش دلقِ ما کز این بهتر نمی‌ارزد"],["چه آسان می‌نمود اول غمِ دریا به بوی سود","غلط کردم که این طوفان به صد گوهر نمی‌ارزد"],["چو حافظ در قناعت کوش و از دنیایِ دون بگذر","که یک جو مِنَّتِ دونان دو صد من زر نمی‌ارزد"],["دیگران قرعهٔ قسمت همه بر عیش زدند","دل غمدیدهٔ ما بود که هم بر غم زد"],["نگارم دوش در مجلس به عزمِ رقص چون برخاست","گره بگشود از ابرو و بر دل‌های یاران زد"],["بر آستانِ جانان گر سر توان نهادن","گلبانگِ سربلندی بر آسمان توان زد"],["شد رهزنِ سلامت زلفِ تو وین عجب نیست","گر راهزن تو باشی صد کاروان توان زد"],["تو عمر خواه و صبوری که چرخِ شعبده باز","هزار بازی از این طُرفه‌تر برانگیزد"],["هزار نقش برآید ز کِلکِ صُنع و یکی","به دلپذیری نقشِ نگارِ ما نرسد"],["هر که را با خطِ سبزت سرِ سودا باشد","پای از این دایره بیرون نَنِهَد تا باشد"],["تو خود ای گوهرِ یک دانه کجایی آخِر","کز غمت دیدهٔ مردم همه دریا باشد"],["از بُنِ هر مژه‌ام آب روان است بیا","اگرت میلِ لبِ جوی و تماشا باشد"],["صوفیِ ما که ز وِردِ سحری مست شدی","شامگاهش نگران باش که سرخوش باشد"],["خوش بُوَد گر مَحَکِ تجربه آید به میان","تا سِیَه روی شود هر که در او غَش باشد"],["ناز پروردِ تَنَعُّم نَبَرَد راه به دوست","عاشقی شیوهٔ رندانِ بلاکش باشد"],["غمِ دنیای دَنی چند خوری؟ باده بخور","حیف باشد دلِ دانا که مُشَوَّش باشد"],["من آن نگینِ سلیمان به هیچ نَسْتانَم","که گاه گاه بر او دستِ اهرمن باشد"],["هوایِ کویِ تو از سر نمی‌رود آری","غریب را دلِ سرگشته با وطن باشد"],["کِی شعر تر انگیزد خاطر که حزین باشد","یک نکته از این معنی گفتیم و همین باشد"],["کِی شعر تر انگیزد خاطر که حزین باشد","یک نکته از این معنی گفتیم و همین باشد"],["جامِ می و خونِ دل هر یک به کسی دادند","در دایرهٔ قسمت اوضاع چنین باشد"],["در کارِ گلاب و گل حکمِ ازلی این بود","کاین شاهدِ بازاری وان پرده نشین باشد"],["خوش آمد گُل وز آن خوشتر نباشد","که در دستت به جز ساغر نباشد"],["زمانِ خوشدلی دریاب و دُر یاب","که دایم در صدف گوهر نباشد"],["شرابی بی خمارم بخش یا رب","که با وی هیچ دردِ سر نباشد"],["نفسِ بادِ صبا مُشک فشان خواهد شد","عالَمِ پیر دگرباره جوان خواهد شد"],["این تَطاول که کشید از غمِ هجران بلبل","تا سراپردهٔ گل نعره زنان خواهد شد"],["مجالِ من همین باشد که پنهان عشقِ او ورزم","کنار و بوس و آغوشش چه گویم چون نخواهد شد"],["شرابِ لعل و جایِ امن و یارِ مهربان ساقی","دلا کی بِه شود کارت اگر اکنون نخواهد شد"],["روزِ هجران و شبِ فُرقَتِ یار آخر شد","زدم این فال و گذشت اختر و کار آخر شد"],["روزِ هجران و شبِ فُرقَتِ یار آخر شد","زدم این فال و گذشت اختر و کار آخر شد"],["نگارِ من که به مکتب نرفت و خط ننوشت","به غمزه مسئله‌آموزِ صد مُدَرِّس شد"],["ز راهِ میکده یاران عِنان بگردانید","چرا که حافظ از این راه رفت و مفلس شد"],["به کویِ عشق مَنِه بی‌دلیلِ راه، قدم","که من به خویش نمودم صد اهتمام و نشد"],["هزار حیله برانگیخت حافظ از سرِ فکر","در آن هوس که شود آن نگار رام و نشد"],["یاری اندر کس نمی‌بینیم یاران را چه شد؟","دوستی کِی آخر آمد دوستداران را چه شد؟"],["شهرِ یاران بود و خاکِ مهربانان این دیار","مهربانی کِی سر آمد شهریاران را چه شد؟"],["زاهدِ خلوت نشین دوش به میخانه شد","از سرِ پیمان بِرَفت با سرِ پیمانه شد"],["عیبم بپوش زنهار، ای خرقهٔ می آلود","کان پاکِ پاکدامن، بهرِ زیارت آمد"],["در نمازم خَمِ ابرویِ تو با یاد آمد","حالتی رفت که محراب به فریاد آمد"],["در نمازم خَمِ ابرویِ تو با یاد آمد","حالتی رفت که محراب به فریاد آمد"],["از من اکنون طمعِ صبر و دل و هوش مدار","کان تحمل که تو دیدی همه بر باد آمد"],["بویِ بهبود ز اوضاعِ جهان می‌شنوم","شادی آورد گل و بادِ صبا شاد آمد"],["ای عروسِ هنر از بخت شکایت مَنِما","حجلهٔ حُسن بیارای که داماد آمد"],["زیر بارند درختان که تعلق دارند","ای خوشا سرو که از بارِ غم آزاد آمد"],["مژده ای دل که دگر بادِ صبا بازآمد","هدهد خوش خبر از طَرْفِ سبا بازآمد"],["صبا به تهنیتِ پیرِ می فروش آمد","که موسمِ طرب و عیش و ناز و نوش آمد"],["چه جایِ صحبتِ نامحرم است مجلسِ انس؟","سرِ پیاله بپوشان که خرقه پوش آمد"],["سحرم دولتِ بیدار به بالین آمد","گفت برخیز که آن خسرو شیرین آمد"],["سحرم دولتِ بیدار به بالین آمد","گفت برخیز که آن خسرو شیرین آمد"],["قدحی درکش و سرخوش به تماشا بخرام","تا ببینی که نگارت به چه آیین آمد"],["مژدگانی بده ای خلوتیِ نافه گشای","که ز صحرایِ خُتَن آهویِ مُشکین آمد"],["مرغِ دل باز هوادارِ کمان ابروییست","ای کبوتر نگران باش که شاهین آمد"],["ساقیا می بده و غم مخور از دشمن و دوست","که به کامِ دلِ ما آن بشد و این آمد"],["رسمِ بدعهدیِ ایام چو دید ابرِ بهار","گریه‌اش بر سمن و سنبل و نسرین آمد"],["نه هر که چهره برافروخت دلبری داند","نه هر که آینه سازد سِکندری داند"],["هزار نکتهٔ باریک‌تر ز مو این جاست","نه هر که سر بتراشد قلندری داند"],["ز شعرِ دلکَشِ حافظ کسی بُوَد آگاه","که لطفِ طبع و سخن گفتن دری داند"],["هر که شد محرمِ دل در حرمِ یار بِمانْد","وان که این کار ندانست در انکار بِمانْد"],["هر که شد محرمِ دل در حرمِ یار بِمانْد","وان که این کار ندانست در انکار بِمانْد"],["اگر از پرده برون شد دلِ من عیب مکن","شُکر ایزد که نه در پردهٔ پندار بِمانْد"],["محتسب شیخ شد و فِسقِ خود از یاد بِبُرد","قصهٔ ماست که در هر سرِ بازار بِمانْد"],["هر مِیِ لعل کز آن دستِ بلورین سِتَدیم","آبِ حسرت شد و در چشمِ گهربار بِمانْد"],["از صدایِ سخنِ عشق ندیدم خوشتر","یادگاری که در این گنبدِ دَوّار بِمانْد"],["داشتم دلقی و صد عیبِ مرا می‌پوشید","خرقه رهنِ مِی و مطرب شد و زُنّار بِمانْد"],["بر جمالِ تو چنان صورتِ چین حیران شد","که حدیثش همه جا در در و دیوار بِمانْد"],["رسید مژده که ایامِ غم نخواهد ماند","چنان نماند چنین نیز هم نخواهد ماند"],["رسید مژده که ایامِ غم نخواهد ماند","چنان نماند چنین نیز هم نخواهد ماند"],["سرودِ مجلسِ جمشید گفته‌اند این بود","که جامِ باده بیاور که جم نخواهد ماند"],["غنیمتی شِمُر ای شمع وصلِ پروانه","که این معامله تا صبحدم نخواهد ماند"],["ز آشفتگی حالِ من آگاه کِی شود؟","آن را که دل نگشت گرفتارِ این کمند"],["حاجتِ مطرب و مِی نیست تو بُرقَع بِگُشا","که به رقص آوَرَدَم آتشِ رویت چو سپند"],["مَکُش آن آهویِ مُشکینِ مرا ای صیاد","شرم از آن چشمِ سیه دار و مَبَندَش به کمند"],["منِ خاکی که از این در نَتَوانَم برخاست","از کجا بوسه زنم بر لبِ آن قصرِ بلند؟"],["حَسْبِ حالی نَنِوشتی و شد ایّامی چند","محرمی کو که فرستم به تو پیغامی چند؟"],["زاهد از کوچهٔ رندان به سلامت بگذر","تا خرابت نکند صحبتِ بدنامی چند"],["عیبِ مِی جمله چو گفتی، هنرش نیز بگو","نفیِ حکمت مکن از بهرِ دلِ عامی چند"],["پیرِ میخانه چه خوش گفت به دُردی کشِ خویش","که مگو حالِ دلِ سوخته با خامی چند"],["دوش وقتِ سَحَر از غُصه نجاتم دادند","واندر آن ظلمتِ شب آبِ حیاتم دادند"],["دوش وقتِ سَحَر از غُصه نجاتم دادند","واندر آن ظلمتِ شب آبِ حیاتم دادند"],["من اگر کامروا گشتم و خوشدل چه عجب؟","مستحق بودم و این‌ها به زکاتم دادند"],["این همه شهد و شکر کز سخنم می‌ریزد","اجرِ صبریست کز آن شاخِ نباتم دادند"],["دوش دیدم که ملایک درِ میخانه زدند","گِلِ آدم بِسِرشتَند و به پیمانه زدند"],["دوش دیدم که ملایک درِ میخانه زدند","گِلِ آدم بِسِرشتَند و به پیمانه زدند"],["ساکنانِ حرمِ سِتْر و عِفافِ ملکوت","با منِ راه نشین بادهٔ مستانه زدند"],["آسمان بارِ امانت نتوانست کشید","قرعهٔ کار به نامِ منِ دیوانه زدند"],["آتش آن نیست که از شعلهٔ او خندد شمع","آتش آن است که در خرمن پروانه زدند"],["رقص بر شعرِ تر و نالهٔ نِی خوش باشد","خاصه رقصی که در آن دستِ نگاری گیرند"],["گر مِی فروش حاجتِ رندان روا کند","ایزد گنه ببخشد و دفعِ بلا کند"],["شبانِ وادیِ اِیمن گَهی رسد به مراد","که چند سال به جان، خدمتِ شُعیب کند"],["طایر دولت اگر باز گذاری بِکُنَد","یار بازآید و با وصل قراری بِکُنَد"],["یا وفا، یا خبرِ وصلِ تو، یا مرگِ رقیب","بُوَد آیا که فلک زین دو سه کاری بکند؟"],["کِلکِ مشکین تو روزی که ز ما یاد کند","بِبَرَد اجرِ دو صد بنده که آزاد کند"],["قاصدِ منزلِ سِلمی که سلامت بادش","چه شود گر به سلامی دلِ ما شاد کند؟"],["یا رب اندر دلِ آن خسرو شیرین انداز","که به رحمت گذری بر سرِ فرهاد کند"],["شاه را بِهْ بُوَد از طاعتِ صدساله و زهد","قدرِ یک ساعته عمری که در او، داد کند"],["ره نبردیم به مقصودِ خود اندر شیراز","خُرَّم آن روز که حافظ رَهِ بغداد کند"],["آن کیست کز رویِ کرم، با ما وفاداری کند","بر جایِ بدکاری چو من، یک دَم نکوکاری کند"],["دل به امیدِ رویِ او همدمِ جان نمی‌شود","جان به هوایِ کویِ او خدمتِ تن نمی‌کند"],["در نظربازیِ ما بی‌خبران حیرانند","من چُنینم که نمودم دگر ایشان دانند"],["در نظربازیِ ما بی‌خبران حیرانند","من چُنینم که نمودم دگر ایشان دانند"],["عاقلان نقطهٔ پرگارِ وجودند ولی","عشق داند که در این دایره سرگردانند"],["جلوه‌گاهِ رخِ او دیدهٔ من تنها نیست","ماه و خورشید همین آینه می‌گردانند"],["عهد ما با لبِ شیرین‌دهنان بست خدا","ما همه بنده و این قوم خداوندانند"],["مُفلِسانیم و هوایِ مِی و مُطرب داریم","آه اگر خرقهٔ پشمین به گرو نَسْتانند"],["لافِ عشق و گِلِه از یار زَهی لافِ دروغ","عشقبازانِ چُنین، مستحقِ هجرانند"],["مگرم چشمِ سیاهِ تو بیاموزد کار","ور نه مستوری و مستی همه کس نَتْوانند"],["تو دستگیر شو ای خضرِ پی خجسته که من","پیاده می‌روم و هَمرَهان سوارانند"],["آنان که خاک را به نظر کیمیا کنند","آیا بُوَد که گوشهٔ چشمی به ما کنند"],["حالی درونِ پرده بسی فتنه می‌رود","تا آن زمان که پرده برافتد چه‌ها کنند"],["گر سنگ از این حدیث بنالد عجب مدار","صاحبدلان حکایتِ دل خوش ادا کنند"],["پیراهنی که آید از او بویِ یوسفم","ترسم برادران غَیورش قَبا کنند"],["واعظان کاین جلوه در محراب و منبر می‌کنند","چون به خلوت می‌روند آن کارِ دیگر می‌کنند"],["مشکلی دارم ز دانشمندِ مجلس بازپرس","توبه فرمایان چرا خود توبه کمتر می‌کنند؟"],["گوییا باور نمی‌دارند روزِ داوری","کاین همه قَلب و دَغَل در کارِ داور می‌کنند"],["فِی الجُمله اعتماد مَکُن بر ثباتِ دَهر","کاین کارخانه‌ایست که تغییر می‌کنند"],["مِی خور که شیخ و حافظ و مفتی و محتسب","چون نیک بنگری همه تزویر می‌کنند"],["به هوش باش که هنگامِ بادِ اِستغنا","هزار خرمنِ طاعت به نیمْ جو ننهند"],["بُوَد آیا که درِ میکده‌ها بگشایند","گره از کارِ فروبستهٔ ما بگشایند"],["اگر از بهرِ دلِ زاهدِ خودبین بستند","دل قوی دار که از بهرِ خدا بگشایند"],["درِ میخانه ببستند خدایا مپسند","که درِ خانهٔ تزویر و ریا بگشایند"],["یاد باد آن که نَهانَت نظری با ما بود","رَقَمِ مِهرِ تو بر چهرهٔ ما پیدا بود"],["تا ز میخانه و مِی نام و نشان خواهد بود","سرِ ما خاکِ رَهِ پیرِ مُغان خواهد بود"],["حلقهٔ پیرِ مغان از ازلم در گوش است","بر همانیم که بودیم و همان خواهد بود"],["بر سرِ تربتِ ما چون گذری همّت خواه","که زیارتگَهِ رِندانِ جهان خواهد بود"],["برو ای زاهدِ خودبین که ز چشمِ من و تو","رازِ این پرده نهان است و نهان خواهد بود"],["پیش از اینَت بیش از این اندیشهٔ عُشّاق بود","مِهرورزیِ تو با ما شُهرهٔ آفاق بود"],["پیش از اینَت بیش از این اندیشهٔ عُشّاق بود","مِهرورزیِ تو با ما شُهرهٔ آفاق بود"],["یاد باد آن صحبتِ شب‌ها که با نوشین لبان","بحثِ سِرِّ عشق و ذکرِ حلقهٔ عُشّاق بود"],["پیش از این کاین سقفِ سبز و طاقِ مینا بَرکِشند","مَنظَرِ چشمِ مرا ابرویِ جانان طاق بود"],["از دَمِ صبحِ ازل تا آخرِ شامِ ابد","دوستی و مِهر بر یک عهد و یک میثاق بود"],["سایهٔ معشوق اگر افتاد بر عاشق چه شد؟","ما به او محتاج بودیم او به ما مشتاق بود"],["رشتهٔ تسبیح اگر بُگْسَست معذورم بدار","دستم اندر دامنِ ساقیِ سیمین ساق بود"],["یاد باد آن که سرِ کویِ توام منزل بود","دیده را روشنی از خاکِ درت حاصل بود"],["آه از آن جور و تَطاول که در این دامگَه است","آه از آن سوز و نیازی که در آن محفل بود"],["در دلم بود که بی دوست نباشم هرگز","چه توان کرد؟ که سعیِ من و دل باطل بود"],["دوش بر یادِ حریفان به خرابات شدم","خُمِ مِی دیدم، خون در دل و پا در گل بود"],["بس بِگَشتَم که بپرسم سببِ دردِ فِراق","مفتیِ عقل در این مسأله لایَعْقِل بود"],["راستی خاتمِ فیروزهٔ بواسحاقی","خوش درخشید ولی دولتِ مُستَعجِل بود"],["دیدی آن قهقههٔ کبکِ خرامان حافظ","که ز سرپنجهٔ شاهینِ قضا غافل بود"],["یا رب این آینهٔ حُسن چه جوهر دارد؟","که در او آهِ مرا قُوَّتِ تأثیر نبود"],["تا مگر همچو صبا باز به کویِ تو رَسَم","حاصلم دوش به جز نالهٔ شبگیر نبود"],["دوش در حلقهٔ ما قصّهٔ گیسویِ تو بود","تا دلِ شب سخن از سلسلهٔ مویِ تو بود"],["دل که از ناوَکِ مژگانِ تو در خون می‌گشت","باز مشتاقِ کمانخانهٔ ابرویِ تو بود"],["دوش می‌آمد و رخساره برافروخته بود","تا کجا باز دلِ غمزده‌ای سوخته بود"],["رسم عاشق کُشی و شیوهٔ شهرآشوبی","جامه‌ای بود که بر قامتِ او دوخته بود"],["یار مَفروش به دنیا که بسی سود نکرد","آن که یوسف به زَرِ ناسره بفروخته بود"],["از سرِ مستی دگر با شاهدِ عهدِ شباب","رجعتی می‌خواستم لیکن طلاق افتاده بود"],["در مقاماتِ طریقت هر کجا کردیم سِیر","عافیت را با نظربازی فِراق افتاده بود"],["ساقیا جامِ دَمادَم ده که در سِیرِ طریق","هر که عاشق‌وَش نیامد در نفاق افتاده بود"],["حافظ آن ساعت که این نظمِ پریشان می‌نوشت","طایرِ فکرش به دامِ اشتیاق افتاده بود"],["از صبا پرس که ما را همه شب تا دمِ صبح","بویِ زلفِ تو همان مونسِ جان است که بود"],["چل سال رنج و غصه کشیدیم و عاقبت","تدبیرِ ما به دستِ شرابِ دوساله بود"],["آن نافهٔ مراد که می‌خواستم ز بخت","در چینِ زلفِ آن بتِ مشکین کُلاله بود"],["از دست برده بود خمارِ غمم سحر","دولت مساعد آمد و مِی در پیاله بود"],["دیدیم شعرِ دلکش حافظ به مدحِ شاه","یک بیت از این قصیده بِه از صد رساله بود"],["دل گفت فروکش کنم این شهر به بویش","بیچاره ندانست که یارش سفری بود"],["تنها نه ز رازِ دلِ من پرده برافتاد","تا بود فلک، شیوهٔ او پرده دری بود"],["اوقاتِ خوش آن بود که با دوست به سر رفت","باقی همه بی‌حاصلی و بی‌خبری بود"],["مسلمانان مرا وقتی دلی بود","که با وی گفتمی گر مشکلی بود"],["مسلمانان مرا وقتی دلی بود","که با وی گفتمی گر مشکلی بود"],["گر چه بی‌سامان نماید کارِ ما، سهلش مبین","کاندر این کشور گدایی، رَشکِ سلطانی بُوَد"],["کامِ خود آخرِ عمر از مِی و معشوق بگیر","حیفِ اوقات که یک سر به بطالت برود"],["هرگزم نقشِ تو از لوحِ دل و جان نَرَوَد","هرگز از یادِ من آن سروِ خرامان نَرَوَد"],["هرگزم نقشِ تو از لوحِ دل و جان نَرَوَد","هرگز از یادِ من آن سروِ خرامان نَرَوَد"],["در ازل بست دلم با سرِ زلفت پیوند","تا ابد سر نَکَشَد، وز سرِ پیمان نرود"],["آن چُنان مِهر توام در دل و جان جای گرفت","که اگر سر برود، از دل و از جان نرود"],["هر که خواهد که چو حافظ نشود سرگردان","دل به خوبان ندهد وز پِی ایشان نرود"],["ترسم که اشک در غمِ ما پرده‌در شود","وین رازِ سر به مُهر به عالَم سَمَر شود"],["ترسم که اشک در غمِ ما پرده‌در شود","وین رازِ سر به مُهر به عالَم سَمَر شود"],["گویند سنگ لَعل شود در مَقامِ صبر","آری شود، ولیک به خونِ جگر شود"],["خواهم شدن به میکده گریان و دادخواه","کز دستِ غم خلاصِ من آن جا مگر شود"],["از هر کرانه تیرِ دعا کرده‌ام روان","باشد کز آن میانه یکی کارگر شود"],["در تنگنایِ حیرتم از نخوت رقیب","یا رب مباد آن که گدا معتبر شود"],["عشق می‌ورزم و امّید که این فَنِّ شریف","چون هنرهایِ دگر موجب حِرمان نشود"],["دوش می‌گفت که فردا بدهم کامِ دلت","سببی ساز خدایا که پشیمان نشود"],["یا رب اندر کَنَفِ سایهٔ آن سروِ بلند","گر منِ سوخته یک دَم بنشینم چه شود؟"],["آخِر ای خاتَمِ جمشیدِ همایون آثار","گر فِتَد عکسِ تو بر نقشِ نگینم چه شود؟"],["جهانیان همه گر منعِ من کنند از عشق","من آن کنم که خداوندگار فرماید"],["طمع ز فیضِ کرامت مَبُر که خُلقِ کریم","گنه ببخشد و بر عاشقان بِبَخشاید"],["گفتم غمِ تو دارم گفتا غمت سر آید","گفتم که ماهِ من شو گفتا اگر برآید"],["گفتم ز مِهرورزان رسمِ وفا بیاموز","گفتا ز خوبرویان این کار کمتر آید"],["گفتم که بویِ زلفت گمراهِ عالَمَم کرد","گفتا اگر بدانی هم اوت رهبر آید"],["گفتم خوشا هوایی کز بادِ صبح خیزد","گفتا خُنُک نسیمی کز کویِ دلبر آید"],["گفتم دلِ رحیمت کِی عزمِ صلح دارد","گفتا مگوی با کس تا وقتِ آن درآید"],["گفتم زمانِ عِشرت دیدی که چون سر آمد","گفتا خموش حافظ کاین غصّه هم سر آید"],["بر سرِ آنم که گر ز دست برآید","دست به کاری زنم که غصّه سر آید"],["خلوتِ دل نیست جایِ صحبت اَضداد","دیو چو بیرون رود، فرشته درآید"],["بلبلِ عاشق، تو عمر خواه که آخِر","باغ شود سبز و شاخِ گُل به بر آید"],["دست از طلب ندارم تا کامِ من برآید","یا تن رسد به جانان یا جان ز تن برآید"],["دست از طلب ندارم تا کامِ من برآید","یا تن رسد به جانان یا جان ز تن برآید"],["بگشای تربتم را بعد از وفات و بنگر","کز آتش درونم دود از کفن برآید"],["گرت چو نوحِ نبی صبر هست در غمِ طوفان","بلا بگردد و کامِ هزارساله برآید"],["نسیمِ زلفِ تو چون بگذرد به تربتِ حافظ","ز خاکِ کالبدش صد هزار لاله برآید"],["اگر آن طایرِ قدسی ز دَرَم بازآید","عمرِ بگذشته به پیرانه سرم بازآید"],["دارم امّید بر این اشکِ چو باران که دگر","برقِ دولت که بِرَفت از نظرم بازآید"],["آن که تاجِ سرِ من خاکِ کفِ پایش بود","از خدا می‌طلبم تا به سرم بازآید"],["گر نثارِ قدمِ یارِ گرامی نکنم","گوهرِ جان به چه کار دگرم بازآید؟"],["کوسِ نو دولتی از بامِ سعادت بزنم","گر ببینم که مَهِ نوسفرم بازآید"],["جهان بر ابرویِ عید از هِلال وَسمه کشید","هِلال عید در ابرویِ یار باید دید"],["بیا که با تو بگویم غمِ ملالتِ دل","چرا که بی تو ندارم مَجالِ گفت و شَنید"],["بهایِ وصلِ تو گر جان بُوَد خریدارم","که جنسِ خوب مُبَصِّر به هر چه دید خرید"],["به لب رسید مرا جان و برنیامد کام","به سر رسید امید و طلب به سر نرسید"],["مَکُن ز غُصه شکایت که در طریقِ طلب","به راحتی نرسید آن که زحمتی نکشید"],["بهار می‌گذرد دادگسترا دریاب","که رفت موسم و حافظ هنوز مِی نچشید"],["تیرِ عاشق کُش ندانم بر دلِ حافظ که زد","این قَدَر دانم که از شعرِ تَرَش خون می‌چکید"],["عزیزِ مصر به رغمِ برادران غیور","ز قعرِ چاه برآمد به اوجِ ماه رسید"],["یا رب کجاست محرمِ رازی که یک زمان","دل شرحِ آن دهد که چه گفت و چه‌ها شنید"],["میانِ عاشق و معشوق فَرق بسیار است","چو یار ناز نماید، شما نیاز کنید"],["هر آن کسی که در این حلقه نیست زنده به عشق","بر او نَمُرده به فتوایِ من نماز کنید"],["غبارِ غم بِرَوَد حال خوش شود حافظ","تو آبِ دیده از این رهگذر دریغ مدار"],["قلب بی‌حاصلِ ما را بزن اکسیرِ مراد","یعنی از خاکِ درِ دوست نشانی به من آر"],["ای صبا نَکهَتی از خاکِ رَهِ یار بیار","بِبَر اندوهِ دل و مژدهٔ دلدار بیار"],["ای صبا نَکهَتی از خاکِ رَهِ یار بیار","بِبَر اندوهِ دل و مژدهٔ دلدار بیار"],["نکته‌ای روح فَزا از دهنِ دوست بگو","نامه‌ای خوش خبر از عالَمِ اسرار بیار"],["کامِ جان تلخ شد از صبر که کردم بی دوست","عشوه‌ای زان لبِ شیرین شِکربار بیار"],["روی بِنْمای و وجودِ خودم از یاد بِبَر","خِرمنِ سوختگان را همه گو باد بِبَر"],["ما چو دادیم دل و دیده به طوفانِ بلا","گو بیا سیلِ غم و خانه ز بنیاد بِبَر"],["روزِ مرگم نفسی وعدهٔ دیدار بده","وان گَهَم تا به لَحَد فارغ و آزاد بِبَر"],["دلا در عاشقی ثابت قدم باش","که در این رَه نباشد کار بی اجر"],["دلم رفت و ندیدم رویِ دلدار","فَغان از این تَطاول، آه از این زَجر"],["گر بُوَد عمر، به میخانه رَسَم بارِ دِگَر","بجز از خدمتِ رندان نکنم کارِ دِگَر"],["خُرَّم آن روز که با دیدهٔ گریان بِرَوَم","تا زنم آب درِ میکده یک بارِ دگر"],["گر مساعد شَوَدَم دایرهٔ چرخِ کبود","هم به دست آورمش باز به پرگارِ دگر"],["هر دم از درد بنالم که فلک هر ساعت","کُنَدَم قصدِ دلِ ریش به آزارِ دگر"],["بازگویم نه در این واقعه حافظ تنهاست","غرقه گشتند در این بادیه بسیارِ دگر"],["حافظ سخن بگوی که بر صفحهٔ جهان","این نقش مانَد از قَلَمَت یادگارِ عمر"],["گر دیگران به عیش و طَرَب خُرَّمَند و شاد","ما را غمِ نگار بُوَد مایهٔ سُرور"],["دورِ گردون گر دو روزی بر مرادِ ما نرفت","دائماً یکسان نباشد حالِ دوران غم مخور"],["بیا و کَشتیِ ما در شَطِ شراب انداز","خروش و وِلوِله در جانِ شیخ و شاب انداز"],["خیز و در کاسهٔ زر آبِ طَرَبناک انداز","پیشتر زان که شَوَد کاسهٔ سَر خاک انداز"],["خیز و در کاسهٔ زر آبِ طَرَبناک انداز","پیشتر زان که شَوَد کاسهٔ سَر خاک انداز"],["عاقبت منزلِ ما وادیِ خاموشان است","حالیا غُلغُله در گنبدِ افلاک انداز"],["روز اول رفت دینم در سرِ زلفین تو","تا چه خواهد شد در این سودا سرانجامم هنوز"],["ای که گفتی جان بده تا باشَدَت آرامِ جان","جان به غم‌هایش سپردم، نیست آرامم هنوز"],["گُلعِذاری ز گلستانِ جهان ما را بس","زین چمن سایهٔ آن سروِ روان ما را بس"],["من و همصحبتیِ اهلِ ریا دورَم باد","از گرانانِ جهان، رَطلِ گران ما را بس"],["قصرِ فردوس به پاداشِ عمل می‌بخشند","ما که رندیم و گدا، دیرِ مُغان ما را بس"],["بنشین بر لبِ جوی و گذرِ عمر ببین","کاین اشارت ز جهانِ گذران، ما را بس"],["یار با ماست، چه حاجت که زیادت طلبیم؟","دولتِ صحبتِ آن مونسِ جان ما را بس"],["فلک به مَردمِ نادان دهد زِمامِ مراد","تو اهل فضلی و دانش، همین گناهت بس"],["دردِ عشقی کشیده‌ام که مَپُرس","زهرِ هجری چشیده‌ام که مَپُرس"],["گشته‌ام در جهان و آخرِ کار","دلبری برگزیده‌ام که مپرس"],["آن چنان در هوایِ خاکِ دَرَش","می‌رود آبِ دیده‌ام که مپرس"],["دارم از زلفِ سیاهش گِلِه چندان که مَپُرس","که چُنان ز او شده‌ام بی سر و سامان که مَپُرس"],["دارم از زلفِ سیاهش گِلِه چندان که مَپُرس","که چُنان ز او شده‌ام بی سر و سامان که مَپُرس"],["کَس به امّیدِ وفا ترکِ دل و دین مَکُناد","که چُنانم من از این کرده پشیمان که مپرس"],["باز آی و دلِ تنگِ مرا مونس جان باش","وین سوخته را مَحرَمِ اسرارِ نهان باش"],["اگر رفیقِ شفیقی درست پیمان باش","حریفِ خانه و گرمابه و گلستان باش"],["باغبان گر پنج‌روزی صحبتِ گل بایدش","بر جفایِ خارِ هجران صبرِ بلبل بایدش"],["ای دل اندر بندِ زلفش از پریشانی مَنال","مرغِ زیرک چون به دام افتد تحمل بایدش"],["فکرِ بلبل همه آن است که گُل شد یارش","گُل در اندیشه که چُون عشوه کُنَد در کارش"],["دلربایی همه آن نیست که عاشق بِکُشَند","خواجه آن است که باشد غَمِ خدمتکارش"],["بلبل از فیضِ گل آموخت سخن، ور نه نبود","این همه قول و غزل تعبیه در منقارش"],["آن سفرکرده که صد قافله دل همرهِ اوست","هر کجا هست خدایا به سلامت دارش"],["شرابِ تلخ می‌خواهم که مردافکن بُوَد زورش","که تا یک دَم بیاسایم ز دنیا و شر و شورش"],["شرابِ تلخ می‌خواهم که مردافکن بُوَد زورش","که تا یک دَم بیاسایم ز دنیا و شر و شورش"],["سِماطِ دَهرِ دون پرور ندارد شهدِ آسایش","مَذاقِ حرص و آز ای دل، بشو از تلخ و از شورَش"],["نظر کردن به درویشان مُنافیِّ بزرگی نیست","سلیمان با چُنان حشمت، نظرها بود با مورش"],["خوشا شیراز و وضعِ بی‌مثالش","خداوندا نگه دار از زَوالش"],["کجاست همنفسی؟ تا به شرح عرضه دَهَم","که دل چه می‌کشد از روزگارِ هجرانش"],["تو خفته‌ای و نشد عشق را کرانه پدید","تبارک الله از این رَه که نیست پایانش"],["یا رب این نوگُلِ خندان که سپردی به مَنَش","می‌سپارم به تو از چشمِ حسودِ چَمَنَش"],["یا رب این نوگُلِ خندان که سپردی به مَنَش","می‌سپارم به تو از چشمِ حسودِ چَمَنَش"],["گر چه از کویِ وفا گشت به صد مرحله دور","دور باد آفتِ دورِ فلک از جان و تَنَش"],["دوش با من گفت پنهان کاردانی تیزهوش","وز شما پنهان نشاید کرد سِرِّ مِی‌فروش"],["گفت آسان گیر بر خود کارها کز رویِ طبع","سخت می‌گردد جهان بر مردمانِ سخت‌کوش"],["تا نگردی آشْنا زین پرده رَمزی نشنوی","گوشِ نامحرم نباشد جایِ پیغامِ سروش"],["در حریمِ عشق نَتْوان زد دَم از گفت و شنید","زان که آنجا جمله اعضا چشم باید بود و گوش"],["بر بساطِ نکته‌دانان خودفروشی شرط نیست","یا سخن دانسته گو ای مردِ عاقل، یا خموش"],["الا ای دولتی طالع، که قدرِ وقت می‌دانی","گوارا بادَت این عِشرت که داری روزگاری خوش"],["ما آزموده‌ایم در این شهر بختِ خویش","بیرون کشید باید از این وَرطه رَختِ خویش"],["رشتهٔ صبرم به مِقراضِ غَمَت بُبْریده شد","همچنان در آتشِ مِهرِ تو سوزانم چو شمع"],["دریغ و دَرد که تا این زمان ندانستم","که کیمیایِ سعادت، رَفیق بود رَفیق"],["اگر شراب خوری جُرعه‌ای فِشان بر خاک","از آن گناه که نَفعی رسد به غیر چه باک؟"],["هزار دشمنم اَر می‌کنند قصدِ هلاک","گَرَم تو دوستی از دشمنان ندارم باک"],["چرخ برهم زنم ار غیرِ مرادم گردد","من نه آنم که زبونی کَشَم از چرخِ فلک"],["شاها فلک از بزمِ تو در رقص و سَماع است","دستِ طَرَب از دامنِ این زمزمه مَگسِل"],["کجا رَوَم چه کنم چاره از کجا جویم؟","که گَشته‌ام ز غم و جورِ روزگار مَلول"],["یا رب این آتش که در جانِ من است","سرد کن زان سان که کردی بر خلیل"],["پای ما لَنگ است و منزل بس دراز","دست ما کوتاه و خرما بر نَخیل"],["مرحبا طایرِ فَرُّخ پِیِ فرخنده پیام","خیرِ مقدم چه خبر؟ دوست کجا؟ راه کدام؟"],["یا رب این قافله را لطفِ ازل بدرقه باد","که از او خصم به دام آمد و معشوقه به کام"],["عاشق و رِند و نظربازم و می‌گویم فاش","تا بدانی که به چندین هنر آراسته‌ام"],["من کز وطن سفر نَگُزیدَم به عمرِ خویش","در عشقِ دیدن تو هواخواهِ غربتم"],["دوش بیماری چشم تو بِبُرد از دستم","لیکن از لطفِ لبت صورتِ جان می‌بستم"],["رُتبَتِ دانشِ حافظ به فلک بَر شده بود","کرد غم‌خواریِ شمشادِ بلندت پَستم"],["اگر چه خَرمَنِ عمرم غمِ تو داد به باد","به خاک پایِ عزیزت که عهد نشکستم"],["زلف بر باد مده تا ندهی بر بادم","ناز بنیاد مکن تا نکَنی بنیادم"],["مِی مخور با همه کس تا نخورم خون جگر","سر مکش تا نکشد سر به فلک فریادم"],["شمع هر جمع مشو ور نه بسوزی ما را","یاد هر قوم مکن تا نروی از یادم"],["شهرهٔ شهر مشو تا نَنَهم سر در کوه","شور شیرین منما تا نکنی فرهادم"],["رحم کن بر من مسکین و به فریادم رَس","تا به خاک در آصف نرسد فریادم"],["فاش می‌گویم و از گفتهٔ خود دلشادم","بندهٔ عشقم و از هر دو جهان آزادم"],["فاش می‌گویم و از گفتهٔ خود دلشادم","بندهٔ عشقم و از هر دو جهان آزادم"],["طایرِ گلشنِ قدسم چه دهم شرحِ فراق؟","که در این دامگَهِ حادثه چون افتادم"],["من مَلَک بودم و فردوسِ بَرین جایَم بود","آدم آورد در این دیرِ خراب آبادم"],["نیست بر لوحِ دلم جز الفِ قامتِ دوست","چه کُنَم؟ حرفِ دِگَر یاد نداد استادم"],["کوکبِ بختِ مرا هیچ مُنَجِّم نَشِناخت","یا رب از مادرِ گیتی به چه طالع زادم؟"],["تا شدم حلقه به گوشِ درِ میخانهٔ عشق","هر دَم آید غمی از نو به مبارکبادم"],["پاک کن چهرهٔ حافظ به سرِ زلف ز اشک","ور نه این سیلِ دَمادَم بِبَرَد بنیادم"],["سال‌ها پیرُویِ مذهبِ رندان کردم","تا به فتویِ خِرَد حرص به زندان کردم"],["سایه‌ای بر دلِ ریشم فِکَن ای گنجِ روان","که من این خانه به سودایِ تو ویران کردم"],["در خِلاف‌آمدِ عادت، بطلب کام که من","کسب جمعیت از آن زلفِ پریشان کردم"],["نقش مستوری و مستی نه به دستِ من و توست","آن چه سلطانِ ازل گفت بکن، آن کردم"],["دارم از لطفِ ازل جنَّتِ فردوس طمع","گر چه دربانی میخانه فراوان کردم"],["این که پیرانه‌سَرَم صحبتِ یوسف بنواخت","اجر صبریست که در کلبهٔ احزان کردم"],["صبح‌خیزی و سلامت طلبی چون حافظ","هر چه کردم همه از دولتِ قرآن کردم"],["گر به دیوانِ غزل صدرنشینم چه عجب؟","سال‌ها بندگیِ صاحبِ دیوان کردم"],["هر چند پیر و خسته دل و ناتوان شدم","هر گَه که یادِ رویِ تو کردم جوان شدم"],["آن روز بر دلم درِ معنی گشوده شد","کز ساکنانِ درگهِ پیرِ مغان شدم"],["مگر زنجیرِ مویی گیردَم دست","وگر نه سر به شیدایی برآرم"],["من از بازویِ خود دارم بسی شُکر","که زورِ مردم آزاری ندارم"],["به طَرَب حمل مَکُن سرخیِ رویم که چو جام","خونِ دل عکس برون می‌دهد از رخسارم"],["در نهانخانهٔ عِشرت صَنَمی خوش دارم","کز سرِ زلف و رُخَش، نعل در آتش دارم"],["عاشق و رندم و میخواره، به آواز بلند","وین همه منصب از آن حورِ  پری وَش دارم"],["ناوَک غمزه بیار و رَسَنِ زلف که من","جنگ‌ها با دلِ مجروح بلاکَش دارم"],["مرا عهدیست با جانان که تا جان در بدن دارم","هوادارانِ کویش را چو جانِ خویشتن دارم"],["مرا عهدیست با جانان که تا جان در بدن دارم","هوادارانِ کویش را چو جانِ خویشتن دارم"],["الا ای پیرِ فرزانه، مَکُن عیبم ز میخانه","که من در تَرکِ پیمانه دلی پیمان شِکن دارم"],["به تیغم گَر کشد دستش نگیرم","وگر تیرم زَنَد منّت پذیرم"],["به تیغم گَر کشد دستش نگیرم","وگر تیرم زَنَد منّت پذیرم"],["برآی ای آفتابِ صبحِ امّید","که در دستِ شبِ هجران اسیرم"],["محمود بُوَد عاقبتِ کار در این راه","گر سر بِرَوَد در سرِ سودایِ اَیازم"],["حافظ غمِ دل با که بگویم؟ که در این دور","جز جام نشاید که بُوَد محرمِ رازم"],["در خراباتِ مُغان گر گذر افتد بازم","حاصلِ خرقه و سجاده، روان دربازم"],["ماجرایِ دلِ خون گشته نگویم با کس","زان که جز تیغِ غمت نیست کسی دَمسازم"],["گر چه پیرم تو شبی تنگ در آغوشم کَش","تا سحرگه ز کنارِ تو جوان برخیزم"],["غمِ غریبی و غربت چو بر نمی‌تابم","به شهرِ خود رَوَم و شهریارِ خود باشم"],["من دوستدارِ رویِ خوش و مویِ دلکَشَم","مَدهوشِ چَشمِ مست و مِیِ صافِ بی‌غَشَم"],["من که از آتشِ دل چون خُمِ مِی در جوشم","مُهر بر لب زده، خون می‌خورم و خاموشم"],["من کِی آزاد شَوَم از غمِ دل؟ چون هر دَم","هندویِ زلفِ بُتی حلقه کُنَد در گوشم"],["پدرم روضهٔ رضوان به دو گندم بفروخت","من چرا مُلکِ جهان را به جوی نفروشم؟"],["خرقه‌پوشیِ من از غایتِ دین‌داری نیست","پرده‌ای بر سرِ صد عیبِ نهان می‌پوشم"],["گر من از سرزنشِ مدَّعیان اندیشم","شیوهٔ مستی و رندی نَرَوَد از پیشم"],["چُنین قفس نه سزایِ چو من خوش اَلحانیست","رَوَم به گلشنِ رضوان، که مرغِ آن چمنم"],["آب و هوای فارس عجب سِفله پرور است","کو همرهی؟ که خیمه از این خاک بَرکَنَم"],["بی تو ای سروِ روان، با گل و گلشن چه کنم؟","زلفِ سنبل چه کَشَم عارضِ سوسن چه کنم؟"],["شاهِ تُرکان چو پسندید و به چاهم انداخت","دستگیر ار نشود لطفِ تَهَمتَن چه کنم؟"],["مددی گر به چراغی نکند آتشِ طور","چارهٔ تیره شبِ وادی ایمن چه کنم؟"],["من نه آن رندم که تَرکِ شاهد و ساغر کنم","محتسب داند که من این کارها کمتر کنم"],["لاله ساغرگیر و نرگس مست و بر ما نامِ فِسق","داوری دارم بسی یا رب، که را داور کنم؟"],["عهد و پیمانِ فلک را نیست چندان اعتبار","عهد با پیمانه بندم، شرط با ساغَر کُنم"],["من که دارم در گدایی گنجِ سلطانی به دست","کِی طمع در گردشِ گردونِ دون‌پَرور کنم"],["صَنَما با غمِ عشقِ تو چه تدبیر کنم؟","تا به کِی در غمِ تو نالهٔ شبگیر کنم؟"],["صَنَما با غمِ عشقِ تو چه تدبیر کنم؟","تا به کِی در غمِ تو نالهٔ شبگیر کنم؟"],["با سرِ زلفِ تو مجموعِ پریشانی خود","کو مجالی که سراسر همه تقریر کنم؟"],["آن زمان کآرزویِ دیدنِ جانم باشد","در نظر نقشِ رخِ خوبِ تو تصویر کنم"],["گر بدانم که وصالِ تو بدین دست دهد","دین و دل را همه دَربازم و توفیر کنم"],["دور شو از برم ای واعظ و بیهوده مگوی","من نه آنم که دگر گوش به تزویر کنم"],["نیست امّید صَلاحی ز فسادِ حافظ","چون که تقدیر چُنین است، چه تدبیر کنم؟"],["دیده دریا کُنَم و صبر به صحرا فِکَنَم","وَاندر این کار دلِ خویش به دریا فِکَنَم"],["از دلِ تنگِ گنهکار برآرم آهی","کآتش اندر گُنَهِ آدم و حوا فکنم"],["مایهٔ خوشدلی آنجاست که دلدار آنجاست","می‌کنم جهد که خود را مگر آنجا فکنم"],["حافظا تکیه بر ایّام چو سهو است و خطا","من چرا عِشرتِ امروز به فردا فکنم"],["دوش سودایِ رُخَش گفتم ز سر بیرون کُنَم","گفت کو زنجیر؟ تا تدبیرِ این مجنون کُنَم"],["دوش سودایِ رُخَش گفتم ز سر بیرون کُنَم","گفت کو زنجیر؟ تا تدبیرِ این مجنون کُنَم"],["من که رَه بُردم به گنجِ حُسنِ بی‌پایان دوست","صد گدایِ همچو خود را بعد از این قارون کنم"],["ز باده خوردن پنهان مَلول شد حافظ","به بانگِ بَربَط و نِی، رازَش آشکاره کنم"],["روزگاری شد که در میخانه خدمت می‌کنم","در لباسِ فقر کارِ اهلِ دولت می‌کنم"],["روزگاری شد که در میخانه خدمت می‌کنم","در لباسِ فقر کارِ اهلِ دولت می‌کنم"],["با صبا افتان و خیزان می‌روم تا کویِ دوست","و از رفیقان ره استمدادِ همت می‌کنم"],["حافظم در مجلسی دُردی‌کشم در محفلی","بنگر این شوخی که چون با خلق، صنعت می‌کنم"],["من ترکِ عشقِ شاهد و ساغر نمی‌کنم","صد بار توبه کردم و دیگر نمی‌کنم"],["باغِ بهشت و سایهٔ طوبی و قصر و حور","با خاکِ کوی دوست برابر نمی‌کنم"],["به مژگان سیَه کردی هزاران رِخنه در دینم","بیا کز چَشمِ بیمارت هزاران دَرد برچینم"],["الا ای همنشینِ دل که یارانت بِرَفت از یاد","مرا روزی مباد آن دَم که بی یادِ تو بنشینم"],["جهان پیر است و بی‌بنیاد از این فرهادکُش فریاد","که کرد افسون و نیرنگش ملول از جانِ شیرینم"],["حالیا مصلحتِ وقت در آن می‌بینم","که کشم رَخت به میخانه و خوش بنشینم"],["جامِ مِی گیرم و از اهلِ ریا دور شَوَم","یعنی از اهلِ جهان پاکدلی بُگزینم"],["سر به آزادگی از خَلق برآرم چون سَرو","گر دهد دست که دامن ز جهان دَرچینم"],["بر دلم گرد ستم‌هاست خدایا مپسند","که مکدر شود آیینه مهرآیینم"],["دوستان عیبِ نظربازیِ حافظ مکنید","که من او را ز مُحِبّانِ شما می‌بینم"],["خُرَّم آن روز کز این منزلِ ویران بروم","راحتِ جان طلبم و از پِیِ جانان بروم"],["خُرَّم آن روز کز این منزلِ ویران بروم","راحتِ جان طلبم و از پِیِ جانان بروم"],["گر چه دانم که به جایی نَبَرد راه غریب","من به بویِ سرِ آن زلفِ پریشان بروم"],["دلم از وحشتِ زندانِ سِکَندَر بگرفت","رخت بربندم و تا مُلکِ سلیمان بروم"],["چون صبا با تنِ بیمار و دلِ بی‌طاقت","به هواداریِ آن سروِ خرامان بروم"],["در رهِ او چو قلم گر به سرم باید رفت","با دلِ زخم‌کَش و دیدهٔ گریان بروم"],["نذر کردم گر از این غم به درآیم روزی","تا درِ میکده شادان و غزل‌خوان بروم"],["گر از این منزلِ ویران به سویِ خانه رَوَم","دگر آن جا که رَوَم عاقل و فرزانه رَوَم"],["زین سفر گر به سلامت به وطن باز رَسَم","نذر کردم که هم از راه به میخانه روم"],["گر ببینم خمِ ابروی چو محرابش باز","سجدهٔ شُکر کنم و از پِیِ شُکرانه روم"],["خُرَّم آن دَم که چو حافظ به تَوَلّای وزیر","سرخوش از میکده با دوست به کاشانه روم"],["من نه آنم که ز جورِ تو بِنالم، حاشا","بندهٔ معتقد و چاکرِ دولتخواهم"],["بسته‌ام در خَمِ گیسویِ تو امّیدِ دراز","آن مبادا که کُنَد دستِ طلب کوتاهم"],["با منِ راه نشین خیز و سوی میکده آی","تا در آن حلقه ببینی که چه صاحب جاهم"],["دَردَم از یار است و درمان نیز هم","دل فدایِ او شد و جان نیز هم"],["دَردَم از یار است و درمان نیز هم","دل فدایِ او شد و جان نیز هم"],["چون سر آمد دولتِ شب‌هایِ وصل","بگذرد ایامِ هِجران نیز هم"],["عمری گذشت تا به امیدِ اشارتی","چشمی بدان دو گوشهٔ ابرو نهاده‌ایم"],["ما بدین در نه پِیِ حشمت و جاه آمده‌ایم","از بد حادثه این جا به پناه آمده‌ایم"],["خیز تا از درِ میخانه گُشادی طلبیم","به رَهِ دوست نشینیم و مُرادی طلبیم"],["ما زِ یاران چَشمِ یاری داشتیم","خود غلط بود آنچه ما پنداشتیم"],["ما زِ یاران چَشمِ یاری داشتیم","خود غلط بود آنچه ما پنداشتیم"],["ما درس سحر در ره میخانه نهادیم","محصول دعا در ره جانانه نهادیم"],["ما درس سحر در ره میخانه نهادیم","محصول دعا در ره جانانه نهادیم"],["در خرمن صد زاهد عاقل زند آتش","این داغ که ما بر دل دیوانه نهادیم"],["خیز تا خرقه صوفی به خرابات بریم","شطح و طامات به بازار خرافات بریم"],["با تو آن عهد که در وادی ایمن بستیم","همچو موسی ارنی گوی به میقات بریم"],["شرممان باد ز پشمینه آلوده خویش","گر بدین فضل و هنر نام کرامات بریم"],["فتنه می‌بارد از این سقف مقرنس برخیز","تا به میخانه پناه از همه آفات بریم"],["در بیابان فنا گم شدن آخر تا کی","ره بپرسیم مگر پی به مهمات بریم"],["حافظ آب رخ خود بر در هر سفله مریز","حاجت آن به که بر قاضی حاجات بریم"],["بیا تا گل برافشانیم و می در ساغر اندازیم","فلک را سقف بشکافیم و طرحی نو دراندازیم"],["بیا تا گل برافشانیم و می در ساغر اندازیم","فلک را سقف بشکافیم و طرحی نو دراندازیم"],["اگر غم لشکر انگیزد که خون عاشقان ریزد","من و ساقی به هم تازیم و بنیادش براندازیم"],["چو در دست است رودی خوش بزن مطرب سرودی خوش","که دست افشان غزل خوانیم و پاکوبان سر اندازیم"],["یکی از عقل می‌لافد یکی طامات می‌بافد","بیا کاین داوری‌ها را به پیش داور اندازیم"],["سخندانیّ و خوشخوانی نمی‌ورزند در شیراز","بیا حافظ که تا خود را به ملکی دیگر اندازیم"],["دوستان وقت گل آن به که به عشرت کوشیم","سخن اهل دل است این و به جان بنیوشیم"],["خوش هواییست فرح بخش خدایا بفرست","نازنینی که به رویش می گلگون نوشیم"],["ما شبی دست برآریم و دعایی بکنیم","غم هجران تو را چاره ز جایی بکنیم"],["دل بیمار شد از دست رفیقان مددی","تا طبیبش به سر آریم و دوایی بکنیم"],["آسمان کشتی ارباب هنر می‌شکند","تکیه آن به که بر این بحر معلّق نکنیم"],["گر بدی گفت حسودی و رفیقی رنجید","گو تو خوش باش که ما گوش به احمق نکنیم"],["دوستان عیب من بی‌دل حیران مکنید","گوهری دارم و صاحب نظری می‌جویم"],["دیده‌ها در طلب لعل یمانی خون شد","یا رب آن کوکب رخشان به یمن بازرسان"],["شاه شمشادقدان خسرو شیرین دهنان","که به مژگان شکند قلب همه صف شکنان"],["شاه شمشادقدان خسرو شیرین دهنان","که به مژگان شکند قلب همه صف شکنان"],["کمتر از ذره نه‌ای پست مشو مهر بورز","تا به خلوتگه خورشید رسی چرخ زنان"],["پیر پیمانه کش من که روانش خوش باد","گفت پرهیز کن از صحبت پیمان شکنان"],["دامن دوست به دست آر و ز دشمن بگسل","مرد یزدان شو و فارغ گذر از اهرمنان"],["من از دست غمت مشکل برم جان","ولی دل را تو آسان بردی از من"],["از جان طمع بریدن آسان بود ولیکن","از دوستان جانی مشکل توان بریدن"],["منم که شهره شهرم به عشق ورزیدن","منم که دیده نیالوده‌ام به بد دیدن"],["منم که شهره شهرم به عشق ورزیدن","منم که دیده نیالوده‌ام به بد دیدن"],["وفا کنیم و ملامت کشیم و خوش باشیم","که در طریقت ما کافریست رنجیدن"],["مبوس جز لب ساقی و جام می حافظ","که دست زهدفروشان خطاست بوسیدن"],["ایام گل چو عمر به رفتن شتاب کرد","ساقی به دور بادهٔ گلگون شتاب کن"],["روزی که چرخ از گل ما کوزه‌ها کند","زنهار کاسه سر ما پرشراب کن"],["ما مرد زهد و توبه و طامات نیستیم","با ما به جام باده صافی خطاب کن"],["ز در درآ و شبستان ما منور کن","هوای مجلس روحانیان معطر کن"],["در راه عشق وسوسهٔ اهرمن بسیست","پیش آی و گوشِ دل به پیام سروش کن"],["با دوستان مضایقه در عمر و مال نیست","صد جان فدای یار نصیحت نیوش کن"],["نقشی بر آب می‌زنم از گریه حالیا","تا کی شود قرین حقیقت مجاز من"],["گر چو فرهادم به تلخی جان برآید باک نیست","بس حکایت‌های شیرین باز می‌ماند ز من"],["به زیر دلق ملمع کمندها دارند","درازدستی این کوته آستینان بین"],["آن که فکرش گره از کار جهان بگشاید","گو در این کار بفرما نظری بهتر از این"],["چراغ صاعقه آن سحاب روشن باد","که زد به خرمن ما آتش محبت او"],["بیا که دوش به مستی سروش عالم غیب","نوید داد که عام است فیض رحمت او"],["مزرع سبز فلک دیدم و داس مه نو","یادم از کشته خویش آمد و هنگام درو"],["تکیه بر اختر شب دزد مکن کاین عیار","تاج کاووس ببرد و کمر کیخسرو"],["آتش زهد و ریا خرمن دین خواهد سوخت","حافظ این خرقه پشمینه بینداز و برو"],["یاران همنشین همه از هم جدا شدند","ماییم و آستانه دولت پناه تو"],["گر چه خورشید فلک چشم و چراغ عالم است","روشنایی بخش چشم اوست خاک پای تو"],["تاب بنفشه می‌دهد طرّهٔ مشک‌سای تو","پردهٔ غنچه می‌درد خندهٔ دلگشای تو"],["من که ملول گشتمی از نفس فرشتگان","قال و مقال عالَمی می‌کشم از برای تو"],["مرا چشمیست خون افشان ز دست آن کمان ابرو","جهان بس فتنه خواهد دید از آن چشم و از آن ابرو"],["غلام چشم آن ترکم که در خواب خوش مستی","نگارین گلشنش روی است و مشکین سایبان ابرو"],["اگر چه مرغ زیرک بود، حافظ در هواداری","به تیر غمزه صیدش کرد، چشم آن کمان ابرو"],["گلبن عیش می‌دمد ساقی گلعذار کو","باد بهار می‌وزد باده خوشگوار کو"],["ما محرمان خلوت انسیم غم مخور","با یار آشنا سخن آشنا بگو"],["به عشق روی تو روزی که از جهان بروم","ز تربتم بدمد سرخ گل به جای گیاه"],["وصال او ز عمر جاودان به","خداوندا مرا آن ده که آن به"],["اگر چه زنده رود آب حیات است","ولی شیراز ما از اصفهان به"],["پیش بالای تو میرم چه به صلح و چه به جنگ","چون به هر حال برازندهٔ ناز آمده‌ای"],["آشنایان ره عشق در این بحر عمیق","غرقه گشتند و نگشتند به آب آلوده"],["گفت حافظ لغز و نکته به یاران مفروش","آه از این لطف به انواع عتاب آلوده"],["آن آهوی سیه چشم از دام ما برون شد","یاران چه چاره سازم با این دل رمیده"],["گر خاطر شریفت رنجیده شد ز حافظ","بازآ که توبه کردیم از گفته و شنیده"],["ساقی بیا که شد قدح لاله پر ز می","طامات تا به چند و خرافات تا به کی"],["بر مهر چرخ و شیوه او اعتماد نیست","ای وای بر کسی که شد ایمن ز مکر وی"],["فردا شراب کوثر و حور از برای ماست","و امروز نیز ساقی مه روی و جام می"],["مخمور جام عشقم ساقی بده شرابی","پر کن قدح که بی می مجلس ندارد آبی"],["با ضعف و ناتوانی همچون نسیم خوش باش","بیماری اندر این ره بهتر ز تندرستی"],["در آستان جانان از آسمان میندیش","کز اوج سربلندی افتی به خاک پستی"],["با مدعی مگویید اسرار عشق و مستی","تا بی‌خبر بمیرد در درد خودپرستی"],["با مدعی مگویید اسرار عشق و مستی","تا بی‌خبر بمیرد در درد خودپرستی"],["عاشق شو ار نه روزی کار جهان سر آید","ناخوانده نقش مقصود از کارگاه هستی"],["هر چند که هجران ثمر وصل برآرد","دهقان جهان کاش که این تخم نکشتی"],["در مصطبه عشق تنعم نتوان کرد","چون بالش زر نیست بسازیم به خشتی"],["سحر با باد می‌گفتم حدیث آرزومندی","خطاب آمد که واثق شو به الطاف خداوندی"],["سحر با باد می‌گفتم حدیث آرزومندی","خطاب آمد که واثق شو به الطاف خداوندی"],["دعای صبح و آه شب کلید گنج مقصود است","بدین راه و روش می‌رو که با دلدار پیوندی"],["الا ای یوسف مصری که کردت سلطنت مغرور","پدر را باز پرس آخر کجا شد مهر فرزندی؟!"],["همایی چون تو عالی‌قدر حرص استخوان تا کی؟!","دریغ آن سایهٔ همت که بر نااهل افکندی"],["گرم زمانه سرافراز داشتی و عزیز","سریر عزتم آن خاک آستان بودی"],["چون این گره گشایم وین راز چون نمایم","دردیّ و سخت دردی کاریّ و صعب کاری"],["تو را که هر چه مراد است در جهان داری","چه غم ز حال ضعیفان ناتوان داری"],["چو گل به دامن از این باغ می‌بری حافظ","چه غم ز ناله و فریاد باغبان داری"],["ز کنج صومعه حافظ مجوی گوهر عشق","قدم برون نه اگر میل جست و جو داری"],["ای صبا سوختگان بر سر ره منتظرند","گر از آن یار سفرکرده پیامی داری"],["ای مگس حضرت سیمرغ نه جولانگه توست","عرض خود می‌بری و زحمت ما می‌داری"],["تو به تقصیر خود افتادی از این در محروم","از که می‌نالی و فریاد چرا می‌داری"],["نه گل از دست غمت رست و نه بلبل در باغ","همه را نعره زنان جامه دران می‌داری"],["چون تویی نرگس باغ نظر ای چشم و چراغ","سر چرا بر من دلخسته گران می‌داری"],["مگذران روز سلامت به ملامت حافظ","چه توقع ز جهان گذران می‌داری"],["آن کس که اوفتاد خدایش گرفت دست","گو بر تو باد تا غم افتادگان خوری"],["یک حرف صوفیانه بگویم اجازت است","ای نور دیده صلح به از جنگ و داوری"],["بکوش خواجه و از عشق بی‌نصیب مباش","که بنده را نخرد کس به عیب بی‌هنری"],["دعای گوشه نشینان بلا بگرداند","چرا به گوشه چشمی به ما نمی‌نگری"],["ز کوی یار می‌آید نسیم باد نوروزی","از این باد ار مدد خواهی چراغ دل برافروزی"],["جدا شد یار شیرینت کنون تنها نشین ای شمع","که حکم آسمان این است اگر سازی و گر سوزی"],["نوبهار است در آن کوش که خوشدل باشی","که بسی گل بدمد باز و تو در گل باشی"],["نوبهار است در آن کوش که خوشدل باشی","که بسی گل بدمد باز و تو در گل باشی"],["من نگویم که کنون با که نشین و چه بنوش","که تو خود دانی اگر زیرک و عاقل باشی"],["نقد عمرت ببرد غصه دنیا به گزاف","گر شب و روز در این قصه مشکل باشی"],["در ره منزل لیلی که خطرهاست در آن","شرط اول قدم آن است که مجنون باشی"],["حافظ از فقر مکن ناله که گر شعر این است","هیچ خوشدل نپسندد که تو محزون باشی"],["جوانی باز می‌آرد به یادم","سماع چنگ و دست افشان ساقی"],["وصال دوستان روزی ما نیست","بخوان حافظ غزل‌های فراقی"],["می ده که گر چه گشتم نامه سیاه عالم","نومید کی توان بود از لطف لایزالی"],["ساقی بیار جامی و از خلوتم برون کش","تا در به در بگردم قلاش و لاابالی"],["از چار چیز مگذر گر عاقلی و زیرک","امن و شراب بی‌غش معشوق و جای خالی"],["آن دم که با تو باشم یک سال هست روزی","وان دم که بی تو باشم یک لحظه هست سالی"],["روزها رفت که دست من مسکین نگرفت","زلف شمشادقدی، ساعد سیم‌اندامی"],["شده‌ام خراب و بدنام و هنوز امیدوارم","که به همت عزیزان برسم به نیک نامی"],["سینه مالامال درد است ای دریغا مرهمی","دل ز تنهایی به جان آمد خدا را همدمی"],["سینه مالامال درد است ای دریغا مرهمی","دل ز تنهایی به جان آمد خدا را همدمی"],["سوختم در چاه صبر از بهر آن شمع چگل","شاه ترکان فارغ است از حال ما کو رستمی"],["در طریق عشقبازی امن و آسایش بلاست","ریش باد آن دل که با درد تو خواهد مرهمی"],["اهل کام و ناز را در کوی رندی راه نیست","رهروی باید جهان سوزی نه خامی بی‌غمی"],["آدمی در عالم خاکی نمی‌آید به دست","عالمی دیگر بباید ساخت وز نو آدمی"],["خیز تا خاطر بدان ترک سمرقندی دهیم","کز نسیمش بوی جوی مولیان آید همی"],["جلوه بخت تو دل می‌برد از شاه و گدا","چشم بد دور که هم جانی و هم جانانی"],["ای نسیم سحری خاک در یار بیار","که کند حافظ از او دیده دل نورانی"],["هواخواه توام جانا و می‌دانم که می‌دانی","که هم نادیده می‌بینی و هم ننوشته می‌خوانی"],["گفتند خلایق که تویی یوسف ثانی","چون نیک بدیدم به حقیقت به از آنی"],["من این مقام به دنیا و آخرت ندهم","اگر چه در پِی‌ام افتند هر دم انجمنی"],["ای که در کشتن ما هیچ مدارا نکنی","سود و سرمایه بسوزی و محابا نکنی"],["رنج ما را که توان برد به یک گوشه چشم","شرط انصاف نباشد که مداوا نکنی"]]